{
    "code": 200,
    "data": [
        {
            "text": "离开了学校,告别了学生生涯,开始了一直追寻的工作生活。虽然不是第一次过上班族的生活，但还是会有兴奋与紧张感。
实习第一个礼拜，算是适应期。主要了解一些公司的背景、产品、发展方向等。刚进入公司的第一天，一切都很陌生，也很新鲜。一张张陌生的面孔，不认识但是都面带微笑很友善。公司负责人很热心，带着我逛这逛那，带我参观了一下公司的整体结构，还给我介绍了同事给我认识。我尝试着和同事沟通，从交谈中也能够学到不少东西。同事们都很热心，很照顾我，经常在我碰到困难的时候便主动伸出援助之手，令我非常感动。
几天之后开始在同事的帮带下，做一些业务相关的活，主要是在一旁协助编辑一些简单的程序。也就是打基础。第一个礼拜的实习，我可以简单的总结为几个字，那就是：多看、多问、多观察、多思考。一方面要发扬自主思考问题的能力，在碰到问题的事情时要自觉努力去独立解决。另一方面要发扬团队精神，团结众人的智慧才能发挥最大的效能。
一周的时间很快就过去了，在这一周里，我还尽量让自己更快地去适应环境，更快融入到这个大集体中，为公司贡献自己力所能及的力量！
                                                                                                                                                                                 "
        },
        {
            "text": "时间过得真快，转眼间，半个月过去了。第二周的工作慢慢开始步入正轨了，现在可以自己做一些事了。这个星期，我主要负责的是公司网站的维护与安全。在师傅的指导下，我学习了怎么把我们的网站放到服务器上，怎么用FTP上传和下载我们公司的网站，怎么去创建一个网页模板，怎样发布公司的产品以及客户的售后服务。这些一切的操作，都在后台管理系统上完成的。对于这个系统，我正在摸索之中，明白一些但还不熟练，觉得挺方便实用的。
在师傅身上，我学到了很多东西。比如他和我说过，即使你专业知识掌握的再好，网站维护的再完美，如果没有客户的光临，即便自己工作做得很到位，那也都是徒劳。事实的确如此，我听了师傅的话，当遇到顾客来下订单的时候，我的态度及语气都是很忠诚的，收到了客户的夸赞，这更是我动力的源泉。
现在的我渐渐地适应了工作的生活，也很清楚自身的不足，我一定要在实习的时间中好好的努力，为将来的工作打下良好的基础。                                                                                                                                                                         "
        },
        {
            "text": "在公司，经过两个礼拜的洗礼，我发现自己进步还是挺可观的。即便之前很少接触销售岗位，但现在对销售这一行也有了新的认识。在这一周里，我仍然做通过网络跟客户沟通的事情。偶尔出去拜访客户，尽可能为公司接下更多的订单，实现更好的效益。
	由于我是一个比较内向的男孩，首次与客户面谈显得比较紧张，也不大顺利，不过有了一次经历之后，进步了不少，再加上师傅的教导和同事的鼓励，自己尝试大胆的去应付，慢慢的好了许多。几天下来，面对经验比我丰富，阅历比我深得多的客户，我也能够通过简练清晰的语言表达，让对方熟悉我们的产品，让他们对我们的产品更加信赖。
	在这一周里，通过和客户的沟通，让我获益匪浅。那些忠诚的客户让我懂得了交际之道，万事都以“敬”为先，让我明白要想谈好一笔生意，出门拜访送礼还是有必要的。
	只有通过不断的努力，不断的尝试，不断的积累经验，才能够发现自己的不足。然后在弥补不足的时候，我们便实实在在的提高了自己。所以，不管怎样，努力去做吧，告诉自己，只要用心，就能做得更好！                                                                                                      "
        },
        {
            "text": "一个月的时间过的很快，每天这样起床、上班、下班，再上班、再下班、然后睡觉；时间过的不知道是该说充实还是荒废。渐渐的忙碌了，忙碌的时间过的是那么的快。
这周厂里的工作真的很杂，只要涉及到计算机方面的所有事物都得去了解和掌握。在工作中接触到不同行业对网络技术的应用，接触到各种不同的故障。例如：端口屏蔽以及线路等问题，利用测试仪器测线路信号，开启端口，检查排障，针对不同问题采用相应的解决技术，工作中经常遇到因为材料不足，接线接口不规范等一系列问题，导致工作时间的延长，在接触到光纤宽带的时候，接触到光纤配线箱以及用户客户端的接线头等终端设备的使用。
还有一些各种高科技产品的配件也是闻所未闻的。在这里工作以后也不得不逼迫自己尽最大的努力去弄清这些东西，这样说来，真的也见识到了很多。这周过的真的很辛苦，可是却不敢这样说，我怕这样想了以后就会让自己有了懒惰的心理。虽然常常很晚才休息，白天也弄得满身是灰，不过我想这才是工作的充实吧。                                                                                                           "
        },
        {
            "text": "(五)
时间过得真快，又一周过去了。这周的实习主要是以学习为主，动手帮忙为辅的情况来执行。另外，从和同事的沟通和交谈中也学到了不少东西。大家都很热心，很照顾我。
这几天我开始接触到了Linux系统，由于在学校曾经学习过这方面的知识，所以我也略懂皮毛。然而，就学校学习的知识而言，远远是不够的。在同事的帮带下，我学会了在Linux下搭建LAMP，因为Linux系统是开源免费的，而且很安全，所以我们公司的网站选择搭建在Linux下。
我用虚拟机搭建了Ubuntu的Linux系统，Ubuntu是一个以桌面应用为主的Linux操作系统，操作起来相对比较简单方便。在虚拟机上摸索了好一阵子，再加上同事的热心帮助，终于对Linux有了新的认识。                                                                                                                                                                          "
        },
        {
            "text": "通过学习，我对Linux系统有了一定的了解。在这一周里，我开始对动态网页产生了浓厚的兴趣。公司的同事对我讲解了做每一个网站的过程及所遇到的技术性的困难，以一个网站为例着重介绍了一些模块的具体实现方法及注意的问题。
看了他的演示之后，我发现制作一个完美的网站并非易事，但我却不畏惧，依然朝着自己的目标大胆尝试。之后我做了一些动态页面，主要包括用户登录，用户注册，文章浏览，留言板等功能。我自认为自己做的网站还很粗糙，功能也很简单，并不美观，了解到美工的重要性，经过自己耐心设计一天工夫的几个页面圆满结束。
通过实习，我才发现自己在学校学到的知识只是一点皮毛，但能通过实践，能够把所学的知识运用起来，也是一件非常开心的事。虽然做出的网页简单粗糙不美观，但这也是我进步的表现，发现了美工软件的应用也是相当重要的。                                                                                                                                                                    "
        },
        {
            "text": "这个星期我学习了如何在网站中加入一些功能代码，连接相应的数据库。一开始就把我弄得一愣一愣的，根本一点思路都没有。盲目的连接了一个留言提交随之而来的又是好几个连接错误。再次向同事请教有关数据库连接的问题。在他们详细的指导下，我终于成功连接了数据库，修正了错误。
各个模块实现的最基本的思想都是想通的，相信通过自己的细心工作，认真的钻研，一定会陆续实现其他模块的功能，完成自己的任务。
实习了好一段时间了，有喜亦有忧。习惯了忙忙碌碌的生活之后，开始怀旧当初的校园生活了。想念和同学们打闹的时光，怀念老师认真备课的课堂……非常感谢一路有你们陪我走过，让我有了今日的成就。在今后的日子里，我会更加努力，永不言弃的工作！                                                                                                                                                                                                                          "
        },
        {
            "text": "又过了一周，这样不停的写周记，感觉就像是数着过日子一样。曾有人说过：将时间倒数，日子过得如此匆匆。现在越来越发觉知识的重要，在实际的工作中常常会碰到涉及各方面的问题和知识，当不知道的时候真的感到很尴尬。在工作中真的觉得经验的积累真的不可小觑。虽然会受到不小的打击，可是却没有打消我的积极性，对于工作的珍惜，我不会这样轻易的放弃。
最近公司里引进了一台评价器，评价器的安装是基于SQL SERVER的，所以评价器系统的程序开发也是用SQL来编写的。将编写好的程序在数据库中附加后，再装入评价器的安装文件和驱动器。然后将安装目录中的连接改为数据库的服务地址，这样，一台对于窗口的评价系统便可运行了不过似乎公司对于自己开发的程序都是很保密的，很难知道程序中的具体语句。现在又有一件让我很感兴趣的事出现了，现在要好好学习数据库了。                                                                                                                                                                    "
        },
        {
            "text": "这个星期我又开始接触到了网站的编辑，对几个频道模板进行改动，使关键内容出现在左侧，方便客户浏览。可能由于系统不够完善，在后台直接改代码会出现问题，所以将代码粘贴到Dreamweaver中进行改动，网页采用表格定位，用Dreamweaver的编辑视图很方便的即可完成。
	接下来学习了flash的简单一些操作，从而继续修改网站模板，使网站更加美观。收集整理一直以来跟同事们的网站设计各个部分，完成公司任务下达的网站目标。一个网站的构成需要很多的东西，让我了解到一个网页的设计，从构思到诞生，是需要多少的人力，多少的精力去完成。对于网站的编辑和规划，我还比较生疏，还有很多需要学习之处。在接下来的一段时间里面，我将以更大的决心，更大的勇气，更大的毅力去完成公司分配下来的任务，使自己更上一层楼。                                                                                                     "
        },
        {
            "text": "又过了一个月，工作还是继续一切的继续.每天穿梭在大街小巷，偶尔也挺享受这样的空闲生活。碰到了同学，听到的最多的就是：“好久不见,成熟多了”。其实挺怕听到这样的评价，自己还不想这么早的老去。和同事们也相处了一段时间了，渐渐的也熟悉了。在他们中，自己的年龄也不算小了。可是却感觉比他们中的任何一个人都幼稚。在外工作时也是，一次在外修电脑时。客户竟然很不相信我是在公司工作而不愿让我将主机带回店里维修，因为没经验，因为刚毕业，这样的怀疑真的很让人心寒，可是却也没有辩解的。在工作中真的觉得经验的积累真的不可小觑，虽然会受到不小的打击，可是却没有打消我的积极性，对于工作的珍惜，我不会这样轻易的放弃。
现在已经常常到县里的各个单位跑了，主要还是送送东西，维修维修计算机，还有网络的连通，也开始接触各式各样的人群。以前很讨厌在人多的地方待，更别说与人交谈了，可是在社会的压力面前才发觉自己也可以这样的滔滔不绝了。社会的历练真的可以改变很多，我不会在困难面前服输，所以我会努力的。                                                                                                   "
        },
        {
            "text": "没有狂风和暴雨的吹打，哪来果实的的成熟;没有刺骨的寒风，哪来坚韧的松柏;没有冰天雪地;哪来傲骨的梅花。彼得逊说过：人生中，经常有无数来自外部的打击，但这些打击究竟会对你产生怎样的影响，最终的决定权在你自己手中。  也许你听过一首歌，歌词是“不抛弃，不放弃”;也许你攻克难题时，老师会对你说：“快解出来了，不要放弃”;也许在长跑时，你会对自己说：“坚持一下就到终点了，不能放弃”。但是，我要告诉你，学会放弃不需要的东西。加油啊！！！
吾人在世，不可厌“今”而徒回思“过去”，梦想“将来”以耗误“现在”的努力。又不可以“今”境自足，毫不拿出“现在”的努力，谋“将来”的发展。宜善用“今”，以努力为“将来”之创造。                                                                                                                                                                                          "
        },
        {
            "text": 工作的生活已渐渐适应甚至可以说是习惯了，每天的进进出出，在路上的奔途常常感觉自己就像个搬运工，不过当听到别人的感谢时，心里也很开心。一直是每天都有这样的感谢才可以让我觉得很有干劲。这周和同事一起去给公司广播重新布线，一直在学校里，每天都可以听到校园各处的广播声，可是没想过自己有一天也会给这些广播施工，为了知道公司多媒体的概念和架设，我也在网上查了很多的资料看，可是觉得太繁琐，一直都没弄懂。可是当看到同事的施工以后，在实践中发觉其实也并不是太难，对于布线的规则也大体相同，只是线不同而已。对于公司广播中最核心的就是工矿和播放主机的设置了，在公司多媒体中常用的设备还有音箱、音柱、话筒、投影、中控……
对于具体的公司多媒体架设还是有很多不懂得地方，以后得努力争取机会去多了解。在施工的过程中真的很辛苦，但是我还是没有后悔过，这样的工作我也可以承受，兴趣比任何都重要。                                                                                                                                                                                         "
        },
        {
            "text": "平时在寝室晃晃荡荡没事干，觉得日子过得好慢好无聊。而在公司里，就完全不一样了，每天紧张的工作状态，完全没有时间考虑其它事情。最近有接触了防火墙的设置，公司请了技术员过来讲解。对于硬件防火墙的设置以前也接触过，所以并不是很陌生，不过这样要真的把设置给别人使用，还是很担心，所以也很认真努力的向技术员学习。这里使用的是网御神州有限公司的SECGATE防火墙，这里的防火墙的主要功能设置在保护服务器，在防火墙中设置了这里服务器所用的公网IP地址，然后在在管理后台中进行各项所需的设置，在防火墙弄过之后接着就是服务器了，对于服务器的具体设置，还有WEB的架设以及控制web正常运行的维护软件，在新的服务器的安装时需用引导盘，然后才可以安装系统。
最近的天气总是变幻无常，但我对工作的热血却始终沸腾不灭，我会继续努力好好工作，努力迈向人生的新台阶。                                                                                                                                                                                          "
        },
        {
            "text": "今天是周日，挑一个晴朗的早晨记下我第一周来的实习心得。实习，虽然不是真正的工作，但却是我工作生涯的一个起点，也是从学生过渡到工作人士的一个不可或缺的必经阶段。
    这一周工作中， 我接触到不同行业对网络技术的应用，接触到各种不同的故障。例如：端口屏蔽以及线路等问题，利用测试仪器测试线路信号，开启端口，检查排障没怎对不同问题采用相应的解决技术，工作中经常遇到因为材料不足，接口接线不规范等一系列问题，导致工作时间的延长，在接触到光纤宽带的时候，接触到光纤配线箱以及用户客户端的接线头等终端设备的使用。
　　这一周又是这么快过去了，每天忙忙碌碌却很开心。大家各忙各的，互相合作，每一个都是不可缺少的，各司其职，各尽其责，相处得也很融洽，我觉得很有收获。                                                                                                                                                                                          "
        },
        {
            "text": "不知不觉的，就发现原来短暂的一星期又过去了。慢慢的，我已经熟悉了编程环境，也能很好的融入到公司里，和同事们有了默契的配合。虽然我还不能一个人独自地完成软件编程，但是编程的所有程序以及流程和方法，我都牢牢地记在心里。 现在想想，和刚踏入公司的时候相比，我简直就是芷若两人。改变是实实在在的，就感觉自己每天都在进步，每天都能够接触新的事物，一点一点的吸收进去。实习的这段时间，虽然短，但学到的东西可不少，如何快速的适应公司的环境，融入企业的团体，如何更好的跟同事沟通，更好的完成既定的任务。这些都不是信手拈来的。都需要一个逐步的从点到面的认识，今天我学到的所有这些都必将是我未来成功的基石，我相信我会通过自己的努力，走向那个成功。                                                                                                                                                                                         "
        },
        {
            "text": "初步来了解了网站的构架，各个模块，和具体实现后，这些天我队网站的各个模块实现的功能进行了进一步的了解。
后面几天的任务是mysql的学习，在学校里我对mysql已有了初步的了解。师傅教我要灵活多变，什么时候要用到临时表，嵌套查询，储存过程用的地方等，叫我多看几个例子，并敲下代码运行下，体会里面的数据生成，查询出自己要的数据等。然后再根据这些数据写出语句，生成需要的流程，这就是数据挖掘的精髓！
通过这一周的学习，我利用在学校学习过的SQL语言跟知识，体会到了数据语言的多变性，灵活运用各种语言，能使一个网页变得丰富多彩。这些天我在学习中成长，在收获中学会坚强，很开心，很快乐。在接下来的一段时间里面，我将以更大的决心，更大的勇气，更大的毅力去完成公司分配下来的任务，使自己更上一层楼。                                                                                                                                                                                         "
        },
        {
            "text": "这周我先去熟悉下网站后台管理操作，及各功能模块的作用，公司网站已经搭建好了很完善的框架，设计好了各种功能模块。我尝试在后台进行了“添加公告”“添加问卷调查”“添加友情链接”等一系列操作。
接着我继续去熟悉网站，熟悉各模块及各种管理操作，完成了添加栏目的操作。发表了文章，又上传了图片，并在后台对文章图片进行审核。但是出现了个问题，上传下载中心的软件时发现不能上传过大文件。于是通过探索查找，我发现能在后台对文件的最大值进行设置。
这周刚好是五一劳动节，公司放假三天，所以任务不是很繁重，SO开心。时间过得真快，转眼已经是实习倒数第二周了，但我对工作的热血却始终沸腾不灭，我会继续努力好好工作，努力迈向人生的新台阶。                                                                                                                                                                                          "
        },
        {
            "text": "本以为实习的时间会很漫长，会很难度过，可是转眼就到了实习结束的时候，还真有点舍不得这个我奋斗了好几个月的地方，这里的人这里的一切现在对于我都是那么熟悉，而我就要离开了，很感谢这里的经理和员工，他们在这段时间里教会了我许多的东西。在实习期间，让我学会了许多事情，懂得了很多道理，概括如下：
    1.走到社会工作，一定要懂得灵活应用，社会没我们想象的复杂，但也没大学里那么单纯，更重要的是随机应变，根据实际情况把决策或计划改变。
    2.不能对自己要求太高，因为期望越大，失望可能会越大，但适当的期望与渴望是非常必要的。
    3.时间靠自己挤出来的，很多情况下我们的时间总觉得不够用，但是如果把自己逼下，是可以挤出时间，或者说我们可以在同一时间里做更多的事情。                                                                                                                                                                                          "
        },
    ]
}
